{"class_name": "Tokenizer", "config": {"num_words": 12000, "filters": "!\"#$%&()*+,-./:;<=>?@[\\]^_`{|}~\t\n", "lower": true, "split": " ", "char_level": false, "oov_token": "<OOV>", "document_count": 1258, "word_counts": "{\"i\": 555, \"feal\": 90, \"sad\": 77, \"feel\": 323, \"nervous\": 30, \"before\": 15, \"every\": 15, \"presentation\": 15, \"anxious\": 60, \"about\": 598, \"my\": 434, \"assignments\": 92, \"thinking\": 17, \"results\": 17, \"makes\": 17, \"me\": 70, \"highkey\": 49, \"im\": 545, \"everything\": 58, \"honestly\": 54, \"worried\": 62, \"life\": 73, \"grades\": 89, \"studies\": 93, \"really\": 27, \"exams\": 107, \"idk\": 108, \"man\": 56, \"future\": 80, \"bad\": 11, \"overwhelmed\": 89, \"college\": 75, \"abt\": 102, \"fr\": 43, \"not\": 81, \"okay\": 6, \"lonely\": 82, \"what\": 25, \"if\": 15, \"fail\": 15, \"tired\": 76, \"lowkey\": 53, \"gonna\": 51, \"lie\": 51, \"feeling\": 6, \"great\": 6, \"sure\": 6, \"tbh\": 50, \"keep\": 37, \"worrying\": 17, \"exhausted\": 24, \"guess\": 6, \"anxius\": 9, \"sadd\": 27, \"ngl\": 48, \"alright\": 6, \"stressed\": 59, \"school\": 71, \"stresed\": 23, \"struggling\": 6, \"thanks\": 6, \"isolated\": 6, \"at\": 6, \"university\": 18, \"havent\": 6, \"made\": 6, \"many\": 26, \"friends\": 12, \"here\": 13, \"wish\": 6, \"had\": 12, \"more\": 6, \"on\": 12, \"campus\": 6, \"sometimes\": 18, \"like\": 31, \"no\": 6, \"one\": 6, \"understands\": 6, \"lonley\": 20, \"confused\": 67, \"lost\": 76, \"falling\": 12, \"behind\": 12, \"everyone\": 12, \"miss\": 11, \"family\": 11, \"a\": 32, \"lot\": 11, \"down\": 12, \"today\": 30, \"is\": 50, \"making\": 12, \"lately\": 12, \"good\": 22, \"enough\": 12, \"drained\": 17, \"from\": 35, \"all\": 55, \"the\": 17, \"work\": 17, \"completely\": 19, \"burned\": 73, \"out\": 94, \"mentally\": 18, \"studying\": 18, \"cant\": 39, \"find\": 20, \"motivation\": 20, \"to\": 34, \"study\": 26, \"anymore\": 20, \"studied\": 17, \"night\": 17, \"and\": 17, \"up\": 42, \"with\": 48, \"workload\": 21, \"stressing\": 21, \"have\": 22, \"so\": 20, \"deadlines\": 20, \"coming\": 20, \"there\": 24, \"too\": 17, \"much\": 17, \"coursework\": 17, \"this\": 17, \"semester\": 17, \"just\": 8, \"checking\": 6, \"in\": 6, \"evening\": 2, \"how\": 14, \"are\": 24, \"you\": 39, \"need\": 1, \"someone\": 1, \"talk\": 13, \"hii\": 2, \"bot\": 6, \"can\": 19, \"help\": 7, \"we\": 8, \"chat\": 8, \"for\": 6, \"bit\": 6, \"do\": 4, \"helo\": 3, \"chatbot\": 4, \"helloo\": 1, \"hi\": 11, \"wanted\": 7, \"tell\": 1, \"something\": 2, \"hello\": 6, \"hey\": 9, \"again\": 3, \"bored\": 2, \"conversation\": 1, \"want\": 1, \"ther\": 1, \"hellooo\": 1, \"doing\": 1, \"day\": 13, \"lets\": 2, \"friend\": 1, \"greetings\": 1, \"company\": 1, \"things\": 1, \"dont\": 1, \"leave\": 1, \"question\": 1, \"stay\": 1, \"hows\": 2, \"it\": 2, \"going\": 2, \"whats\": 2, \"afternoon\": 1, \"available\": 1, \"understand\": 1, \"busy\": 1, \"chatting\": 1, \"robot\": 1, \"see\": 1, \"ask\": 1, \"nice\": 1, \"meet\": 1, \"who\": 1, \"real\": 1, \"why\": 1, \"morning\": 2, \"buddy\": 1, \"remember\": 1, \"did\": 6, \"well\": 6, \"test\": 6, \"was\": 6, \"proud\": 6, \"of\": 6, \"finishing\": 6, \"project\": 6, \"productive\": 6, \"finished\": 6, \"assignment\": 6}", "word_docs": "{\"i\": 549, \"sad\": 77, \"feal\": 90, \"presentation\": 15, \"before\": 15, \"feel\": 323, \"nervous\": 30, \"every\": 15, \"assignments\": 92, \"my\": 434, \"about\": 598, \"anxious\": 60, \"me\": 70, \"makes\": 17, \"thinking\": 17, \"results\": 17, \"highkey\": 49, \"everything\": 58, \"im\": 545, \"worried\": 62, \"life\": 73, \"honestly\": 54, \"grades\": 89, \"studies\": 93, \"exams\": 107, \"really\": 27, \"man\": 56, \"future\": 80, \"idk\": 108, \"bad\": 11, \"overwhelmed\": 89, \"college\": 75, \"abt\": 102, \"fr\": 43, \"okay\": 6, \"not\": 81, \"lonely\": 82, \"fail\": 15, \"if\": 15, \"what\": 25, \"tired\": 76, \"lowkey\": 53, \"lie\": 51, \"gonna\": 51, \"feeling\": 6, \"great\": 6, \"sure\": 6, \"tbh\": 50, \"keep\": 37, \"worrying\": 17, \"exhausted\": 24, \"guess\": 6, \"anxius\": 9, \"sadd\": 27, \"ngl\": 48, \"alright\": 6, \"stressed\": 59, \"school\": 71, \"stresed\": 23, \"struggling\": 6, \"thanks\": 6, \"isolated\": 6, \"at\": 6, \"university\": 18, \"here\": 13, \"many\": 26, \"friends\": 12, \"made\": 6, \"havent\": 6, \"had\": 12, \"more\": 6, \"wish\": 6, \"campus\": 6, \"on\": 12, \"one\": 6, \"no\": 6, \"sometimes\": 18, \"understands\": 6, \"like\": 31, \"lonley\": 20, \"confused\": 67, \"lost\": 76, \"falling\": 12, \"everyone\": 12, \"behind\": 12, \"a\": 32, \"lot\": 11, \"family\": 11, \"miss\": 11, \"today\": 30, \"down\": 12, \"making\": 12, \"lately\": 12, \"is\": 50, \"good\": 22, \"enough\": 12, \"the\": 17, \"from\": 35, \"all\": 55, \"work\": 17, \"drained\": 17, \"completely\": 19, \"burned\": 73, \"out\": 94, \"mentally\": 18, \"studying\": 18, \"cant\": 39, \"study\": 26, \"find\": 20, \"anymore\": 20, \"motivation\": 20, \"to\": 33, \"night\": 17, \"and\": 17, \"studied\": 17, \"with\": 48, \"up\": 42, \"workload\": 21, \"stressing\": 21, \"have\": 22, \"coming\": 20, \"so\": 20, \"deadlines\": 20, \"too\": 17, \"this\": 17, \"semester\": 17, \"there\": 24, \"coursework\": 17, \"much\": 17, \"in\": 6, \"checking\": 6, \"just\": 8, \"evening\": 2, \"you\": 39, \"are\": 24, \"how\": 14, \"talk\": 13, \"need\": 1, \"someone\": 1, \"bot\": 6, \"hii\": 2, \"can\": 19, \"help\": 7, \"for\": 6, \"we\": 8, \"bit\": 6, \"chat\": 8, \"do\": 4, \"helo\": 3, \"chatbot\": 4, \"helloo\": 1, \"wanted\": 7, \"hi\": 11, \"tell\": 1, \"something\": 2, \"hello\": 6, \"again\": 3, \"hey\": 9, \"bored\": 2, \"conversation\": 1, \"want\": 1, \"ther\": 1, \"hellooo\": 1, \"doing\": 1, \"day\": 13, \"lets\": 2, \"friend\": 1, \"greetings\": 1, \"company\": 1, \"things\": 1, \"dont\": 1, \"leave\": 1, \"question\": 1, \"stay\": 1, \"hows\": 2, \"going\": 2, \"it\": 2, \"whats\": 2, \"afternoon\": 1, \"available\": 1, \"understand\": 1, \"busy\": 1, \"chatting\": 1, \"robot\": 1, \"see\": 1, \"ask\": 1, \"nice\": 1, \"meet\": 1, \"who\": 1, \"real\": 1, \"why\": 1, \"morning\": 2, \"buddy\": 1, \"remember\": 1, \"test\": 6, \"well\": 6, \"did\": 6, \"was\": 6, \"project\": 6, \"proud\": 6, \"of\": 6, \"finishing\": 6, \"productive\": 6, \"assignment\": 6, \"finished\": 6}", "index_docs": "{\"3\": 549, \"19\": 77, \"13\": 90, \"97\": 15, \"95\": 15, \"6\": 323, \"52\": 30, \"96\": 15, \"12\": 92, \"5\": 434, \"2\": 598, \"29\": 60, \"26\": 70, \"82\": 17, \"80\": 17, \"81\": 17, \"40\": 49, \"31\": 58, \"4\": 545, \"28\": 62, \"23\": 73, \"34\": 54, \"14\": 89, \"11\": 93, \"8\": 107, \"54\": 27, \"32\": 56, \"18\": 80, \"7\": 108, \"114\": 11, \"15\": 89, \"22\": 75, \"9\": 102, \"43\": 43, \"126\": 6, \"17\": 81, \"16\": 82, \"99\": 15, \"98\": 15, \"58\": 25, \"20\": 76, \"35\": 53, \"37\": 51, \"36\": 51, \"127\": 6, \"128\": 6, \"129\": 6, \"38\": 50, \"47\": 37, \"83\": 17, \"59\": 24, \"130\": 6, \"119\": 9, \"55\": 27, \"41\": 48, \"131\": 6, \"30\": 59, \"25\": 71, \"62\": 23, \"132\": 6, \"133\": 6, \"134\": 6, \"135\": 6, \"76\": 18, \"101\": 13, \"56\": 26, \"104\": 12, \"137\": 6, \"136\": 6, \"105\": 12, \"139\": 6, \"138\": 6, \"140\": 6, \"106\": 12, \"142\": 6, \"141\": 6, \"77\": 18, \"143\": 6, \"51\": 31, \"67\": 20, \"27\": 67, \"21\": 76, \"107\": 12, \"109\": 12, \"108\": 12, \"50\": 32, \"117\": 11, \"116\": 11, \"115\": 11, \"53\": 30, \"110\": 12, \"111\": 12, \"112\": 12, \"39\": 50, \"63\": 22, \"113\": 12, \"85\": 17, \"48\": 35, \"33\": 55, \"86\": 17, \"84\": 17, \"74\": 19, \"24\": 73, \"10\": 94, \"78\": 18, \"79\": 18, \"45\": 39, \"57\": 26, \"68\": 20, \"70\": 20, \"69\": 20, \"49\": 33, \"88\": 17, \"89\": 17, \"87\": 17, \"42\": 48, \"44\": 42, \"65\": 21, \"66\": 21, \"64\": 22, \"73\": 20, \"71\": 20, \"72\": 20, \"90\": 17, \"93\": 17, \"94\": 17, \"60\": 24, \"92\": 17, \"91\": 17, \"145\": 6, \"144\": 6, \"121\": 8, \"165\": 2, \"46\": 39, \"61\": 24, \"100\": 14, \"102\": 13, \"175\": 1, \"176\": 1, \"146\": 6, \"166\": 2, \"75\": 19, \"124\": 7, \"147\": 6, \"122\": 8, \"148\": 6, \"123\": 8, \"161\": 4, \"163\": 3, \"162\": 4, \"177\": 1, \"125\": 7, \"118\": 11, \"178\": 1, \"167\": 2, \"149\": 6, \"164\": 3, \"120\": 9, \"168\": 2, \"179\": 1, \"180\": 1, \"181\": 1, \"182\": 1, \"183\": 1, \"103\": 13, \"169\": 2, \"184\": 1, \"185\": 1, \"186\": 1, \"187\": 1, \"188\": 1, \"189\": 1, \"190\": 1, \"191\": 1, \"170\": 2, \"172\": 2, \"171\": 2, \"173\": 2, \"192\": 1, \"193\": 1, \"194\": 1, \"195\": 1, \"196\": 1, \"197\": 1, \"198\": 1, \"199\": 1, \"200\": 1, \"201\": 1, \"202\": 1, \"203\": 1, \"204\": 1, \"174\": 2, \"205\": 1, \"206\": 1, \"152\": 6, \"151\": 6, \"150\": 6, \"153\": 6, \"157\": 6, \"154\": 6, \"155\": 6, \"156\": 6, \"158\": 6, \"160\": 6, \"159\": 6}", "index_word": "{\"1\": \"<OOV>\", \"2\": \"about\", \"3\": \"i\", \"4\": \"im\", \"5\": \"my\", \"6\": \"feel\", \"7\": \"idk\", \"8\": \"exams\", \"9\": \"abt\", \"10\": \"out\", \"11\": \"studies\", \"12\": \"assignments\", \"13\": \"feal\", \"14\": \"grades\", \"15\": \"overwhelmed\", \"16\": \"lonely\", \"17\": \"not\", \"18\": \"future\", \"19\": \"sad\", \"20\": \"tired\", \"21\": \"lost\", \"22\": \"college\", \"23\": \"life\", \"24\": \"burned\", \"25\": \"school\", \"26\": \"me\", \"27\": \"confused\", \"28\": \"worried\", \"29\": \"anxious\", \"30\": \"stressed\", \"31\": \"everything\", \"32\": \"man\", \"33\": \"all\", \"34\": \"honestly\", \"35\": \"lowkey\", \"36\": \"gonna\", \"37\": \"lie\", \"38\": \"tbh\", \"39\": \"is\", \"40\": \"highkey\", \"41\": \"ngl\", \"42\": \"with\", \"43\": \"fr\", \"44\": \"up\", \"45\": \"cant\", \"46\": \"you\", \"47\": \"keep\", \"48\": \"from\", \"49\": \"to\", \"50\": \"a\", \"51\": \"like\", \"52\": \"nervous\", \"53\": \"today\", \"54\": \"really\", \"55\": \"sadd\", \"56\": \"many\", \"57\": \"study\", \"58\": \"what\", \"59\": \"exhausted\", \"60\": \"there\", \"61\": \"are\", \"62\": \"stresed\", \"63\": \"good\", \"64\": \"have\", \"65\": \"workload\", \"66\": \"stressing\", \"67\": \"lonley\", \"68\": \"find\", \"69\": \"motivation\", \"70\": \"anymore\", \"71\": \"so\", \"72\": \"deadlines\", \"73\": \"coming\", \"74\": \"completely\", \"75\": \"can\", \"76\": \"university\", \"77\": \"sometimes\", \"78\": \"mentally\", \"79\": \"studying\", \"80\": \"thinking\", \"81\": \"results\", \"82\": \"makes\", \"83\": \"worrying\", \"84\": \"drained\", \"85\": \"the\", \"86\": \"work\", \"87\": \"studied\", \"88\": \"night\", \"89\": \"and\", \"90\": \"too\", \"91\": \"much\", \"92\": \"coursework\", \"93\": \"this\", \"94\": \"semester\", \"95\": \"before\", \"96\": \"every\", \"97\": \"presentation\", \"98\": \"if\", \"99\": \"fail\", \"100\": \"how\", \"101\": \"here\", \"102\": \"talk\", \"103\": \"day\", \"104\": \"friends\", \"105\": \"had\", \"106\": \"on\", \"107\": \"falling\", \"108\": \"behind\", \"109\": \"everyone\", \"110\": \"down\", \"111\": \"making\", \"112\": \"lately\", \"113\": \"enough\", \"114\": \"bad\", \"115\": \"miss\", \"116\": \"family\", \"117\": \"lot\", \"118\": \"hi\", \"119\": \"anxius\", \"120\": \"hey\", \"121\": \"just\", \"122\": \"we\", \"123\": \"chat\", \"124\": \"help\", \"125\": \"wanted\", \"126\": \"okay\", \"127\": \"feeling\", \"128\": \"great\", \"129\": \"sure\", \"130\": \"guess\", \"131\": \"alright\", \"132\": \"struggling\", \"133\": \"thanks\", \"134\": \"isolated\", \"135\": \"at\", \"136\": \"havent\", \"137\": \"made\", \"138\": \"wish\", \"139\": \"more\", \"140\": \"campus\", \"141\": \"no\", \"142\": \"one\", \"143\": \"understands\", \"144\": \"checking\", \"145\": \"in\", \"146\": \"bot\", \"147\": \"for\", \"148\": \"bit\", \"149\": \"hello\", \"150\": \"did\", \"151\": \"well\", \"152\": \"test\", \"153\": \"was\", \"154\": \"proud\", \"155\": \"of\", \"156\": \"finishing\", \"157\": \"project\", \"158\": \"productive\", \"159\": \"finished\", \"160\": \"assignment\", \"161\": \"do\", \"162\": \"chatbot\", \"163\": \"helo\", \"164\": \"again\", \"165\": \"evening\", \"166\": \"hii\", \"167\": \"something\", \"168\": \"bored\", \"169\": \"lets\", \"170\": \"hows\", \"171\": \"it\", \"172\": \"going\", \"173\": \"whats\", \"174\": \"morning\", \"175\": \"need\", \"176\": \"someone\", \"177\": \"helloo\", \"178\": \"tell\", \"179\": \"conversation\", \"180\": \"want\", \"181\": \"ther\", \"182\": \"hellooo\", \"183\": \"doing\", \"184\": \"friend\", \"185\": \"greetings\", \"186\": \"company\", \"187\": \"things\", \"188\": \"dont\", \"189\": \"leave\", \"190\": \"question\", \"191\": \"stay\", \"192\": \"afternoon\", \"193\": \"available\", \"194\": \"understand\", \"195\": \"busy\", \"196\": \"chatting\", \"197\": \"robot\", \"198\": \"see\", \"199\": \"ask\", \"200\": \"nice\", \"201\": \"meet\", \"202\": \"who\", \"203\": \"real\", \"204\": \"why\", \"205\": \"buddy\", \"206\": \"remember\"}", "word_index": "{\"<OOV>\": 1, \"about\": 2, \"i\": 3, \"im\": 4, \"my\": 5, \"feel\": 6, \"idk\": 7, \"exams\": 8, \"abt\": 9, \"out\": 10, \"studies\": 11, \"assignments\": 12, \"feal\": 13, \"grades\": 14, \"overwhelmed\": 15, \"lonely\": 16, \"not\": 17, \"future\": 18, \"sad\": 19, \"tired\": 20, \"lost\": 21, \"college\": 22, \"life\": 23, \"burned\": 24, \"school\": 25, \"me\": 26, \"confused\": 27, \"worried\": 28, \"anxious\": 29, \"stressed\": 30, \"everything\": 31, \"man\": 32, \"all\": 33, \"honestly\": 34, \"lowkey\": 35, \"gonna\": 36, \"lie\": 37, \"tbh\": 38, \"is\": 39, \"highkey\": 40, \"ngl\": 41, \"with\": 42, \"fr\": 43, \"up\": 44, \"cant\": 45, \"you\": 46, \"keep\": 47, \"from\": 48, \"to\": 49, \"a\": 50, \"like\": 51, \"nervous\": 52, \"today\": 53, \"really\": 54, \"sadd\": 55, \"many\": 56, \"study\": 57, \"what\": 58, \"exhausted\": 59, \"there\": 60, \"are\": 61, \"stresed\": 62, \"good\": 63, \"have\": 64, \"workload\": 65, \"stressing\": 66, \"lonley\": 67, \"find\": 68, \"motivation\": 69, \"anymore\": 70, \"so\": 71, \"deadlines\": 72, \"coming\": 73, \"completely\": 74, \"can\": 75, \"university\": 76, \"sometimes\": 77, \"mentally\": 78, \"studying\": 79, \"thinking\": 80, \"results\": 81, \"makes\": 82, \"worrying\": 83, \"drained\": 84, \"the\": 85, \"work\": 86, \"studied\": 87, \"night\": 88, \"and\": 89, \"too\": 90, \"much\": 91, \"coursework\": 92, \"this\": 93, \"semester\": 94, \"before\": 95, \"every\": 96, \"presentation\": 97, \"if\": 98, \"fail\": 99, \"how\": 100, \"here\": 101, \"talk\": 102, \"day\": 103, \"friends\": 104, \"had\": 105, \"on\": 106, \"falling\": 107, \"behind\": 108, \"everyone\": 109, \"down\": 110, \"making\": 111, \"lately\": 112, \"enough\": 113, \"bad\": 114, \"miss\": 115, \"family\": 116, \"lot\": 117, \"hi\": 118, \"anxius\": 119, \"hey\": 120, \"just\": 121, \"we\": 122, \"chat\": 123, \"help\": 124, \"wanted\": 125, \"okay\": 126, \"feeling\": 127, \"great\": 128, \"sure\": 129, \"guess\": 130, \"alright\": 131, \"struggling\": 132, \"thanks\": 133, \"isolated\": 134, \"at\": 135, \"havent\": 136, \"made\": 137, \"wish\": 138, \"more\": 139, \"campus\": 140, \"no\": 141, \"one\": 142, \"understands\": 143, \"checking\": 144, \"in\": 145, \"bot\": 146, \"for\": 147, \"bit\": 148, \"hello\": 149, \"did\": 150, \"well\": 151, \"test\": 152, \"was\": 153, \"proud\": 154, \"of\": 155, \"finishing\": 156, \"project\": 157, \"productive\": 158, \"finished\": 159, \"assignment\": 160, \"do\": 161, \"chatbot\": 162, \"helo\": 163, \"again\": 164, \"evening\": 165, \"hii\": 166, \"something\": 167, \"bored\": 168, \"lets\": 169, \"hows\": 170, \"it\": 171, \"going\": 172, \"whats\": 173, \"morning\": 174, \"need\": 175, \"someone\": 176, \"helloo\": 177, \"tell\": 178, \"conversation\": 179, \"want\": 180, \"ther\": 181, \"hellooo\": 182, \"doing\": 183, \"friend\": 184, \"greetings\": 185, \"company\": 186, \"things\": 187, \"dont\": 188, \"leave\": 189, \"question\": 190, \"stay\": 191, \"afternoon\": 192, \"available\": 193, \"understand\": 194, \"busy\": 195, \"chatting\": 196, \"robot\": 197, \"see\": 198, \"ask\": 199, \"nice\": 200, \"meet\": 201, \"who\": 202, \"real\": 203, \"why\": 204, \"buddy\": 205, \"remember\": 206}"}}